---
title: "Defining Null Values"
author: "Kamal"
date: 2020-08-12
description: "-"
type: technical_note
draft: false
---

In [1]:
import pandas as pd

In [2]:
d = {'First Score':[100, 90, ".", 95], 
        'Second Score': [30, 45, 56, "-"], 
        'Third Score':["NIL", 40, 80, 98]}

In [3]:
df = pd.DataFrame(d)
df

  First Score Second Score Third Score
0         100           30         NIL
1          90           45          40
2           .           56          80
3          95            -          98

In [4]:
df = df.apply(pd.to_numeric, errors='coerce')
df

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

#### In read_csv

In [ ]:
df = pd.read_csv("name.csv", na_values = ['NIL', '.','-'])